#+OPTIONS: H:2
#+TITLE: Literal Programming Emacs Configure
#+AUTHOR: Jichao Ouyang

* Default Settings
  #+BEGIN_SRC emacs-lisp
    ;; Setting
    (server-start)
    (keyboard-translate ?\C-h ?\C-?)
    (column-number-mode 1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (menu-bar-mode -1)
    (delete-selection-mode 1)
    (global-auto-revert-mode 1)
    (electric-indent-mode t)

    (setq-default
     make-backup-files nil
     indent-tabs-mode nil)
    ;; make unix lineendings default
     (setq default-buffer-file-coding-system 'utf-8-unix)
    (when (eq system-type 'darwin)
      (setq mac-option-modifier 'alt)
      (setq mac-option-modifier 'super) ; make opt key do Super
      (setq mac-command-modifier 'meta))
  #+END_SRC

  #+RESULTS:

#+BEGIN_SRC emacs-lisp
  (setenv "PATH" "/usr/local/bin:/usr/bin:/sbin:/bin")
  (if (eq system-type 'gnu/linux)
      (let ((path-from-shell (shell-command-to-string "/usr/bin/fish -c \"echo -n \\$PATH[1]; for val in \\$PATH[2..-1];echo -n \\\":\\$val\\\";end\"")))
        (setenv "PATH" path-from-shell)
        (setq exec-path (split-string path-from-shell ":")))
    (let ((path-from-shell (shell-command-to-string "/usr/local/bin/fish -c \"echo -n \\$PATH[1]; for val in \\$PATH[2..-1];echo -n \\\":\\$val\\\";end\"")))
      (setenv "PATH" path-from-shell)
      (setq exec-path (split-string path-from-shell ":")))
    )
#+END_SRC
  #+RESULTS:
  | /home/jcouyang/.nix-profile/bin | /home/jcouyang/.local/share/coursier/bin | /home/jcouyang/.nix-profile/bin | /home/jcouyang/.local/share/coursier/bin | /usr/local/bin | /usr/bin | /sbin | /bin |


** fish
#+BEGIN_SRC emacs-lisp
(use-package company-fish
:hook (shell-mode-hook . company-mode)
:init (add-to-list 'company-backends 'company-fish)
)
#+END_SRC

#+RESULTS:
| company-mode |

** indent guide
#+begin_src emacs-lisp
(use-package indent-guide
:hook (prog-mode . indent-guide-mode))
#+end_src

#+RESULTS:
| indent-guide-mode | rainbow-delimiters-mode | (lambda nil (flyspell-prog-mode) (setq company-backends (delete 'company-ispell company-backends)) (message company-ispell disable)) |

** org mode
#+BEGIN_SRC emacs-lisp
     (when (cl-search "27." (emacs-version))
       (require 'org-tempo))
     (setq org-startup-folded 'content)
     (setq org-startup-indented nil)
     (setq org-startup-with-inline-images t)
     (setq org-startup-truncated nil)
     (setq org-src-tab-acts-natively t)

     (setq js-indent-level 2)
#+END_SRC

#+RESULTS:
: 2
#+BEGIN_SRC emacs-lisp
(use-package org-crypt
:config 
(org-crypt-use-before-save-magic)
(setq org-crypt-key "A506C38D5CC847D0DF01134ADA8B833B52604E63")
(setq org-tags-exclude-from-inheritance '("crypt"))
)
#+END_SRC

#+RESULTS:
: t

#+BEGIN_SRC emacs-lisp
  (setq org-agenda-files (quote ("~/Dropbox/org")))
  (setq org-refile-targets (quote ((nil :maxlevel . 9)
                                   (org-agenda-files :maxlevel . 9))))
      (setq org-directory "~/Dropbox/org")
      (setq org-default-notes-file "~/Dropbox/org/refile.org")

      ;; I use C-c c to start capture mode
      (global-set-key (kbd "C-c c") 'org-capture)
      (global-set-key (kbd "C-c a") 'org-agenda)

      ;; Capture templates for: TODO tasks, Notes, appointments, phone calls, meetings, and org-protocol
      (setq org-capture-templates
            (quote (("t" "Todo" entry (file+headline "~/Dropbox/org/refile.org" "Todos")
                     "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
                    ("n" "Note" entry (file+headline "~/Dropbox/org/note.org" "Notes")
                     "* %?\n%U\n%a\n" :clock-in t :clock-resume t)
                    ("w" "Work" entry (file+headline "~/Dropbox/org/myob.org" "Work Notes")
                     "* %?\n%U\n" :clock-in t :clock-resume t)
                    )))
    (setq org-refile-use-outline-path t)

    ; Targets complete directly with IDO
    (setq org-outline-path-complete-in-steps nil)
    ; Use IDO for both buffer and file completion and ido-everywhere to t
    (setq org-completion-use-ido t)
    (setq ido-everywhere t)
    (setq ido-max-directory-size 100000)
    (ido-mode (quote both))
    ; Use the current window when visiting files and buffers with ido
    (setq ido-default-file-method 'selected-window)
    (setq ido-default-buffer-method 'selected-window)
    ; Use the current window for indirect buffer display
    (setq org-indirect-buffer-display 'current-window)

#+END_SRC

#+RESULTS:
: current-window

** rainbow delimiter
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

#+RESULTS:
| rainbow-delimiters-mode | (lambda nil (flyspell-prog-mode) (setq company-backends (delete 'company-ispell company-backends)) (message company-ispell disable)) |

** COMMENT typescript
#+BEGIN_SRC emacs-lisp
(defun setup-tide-mode ()
   (interactive)
   (tide-setup)
   (flycheck-mode +1)
   (setq flycheck-check-syntax-automatically '(save mode-enabled))
   (eldoc-mode +1)
   (tide-hl-identifier-mode +1)
   ;; company is an optional dependency. You have to
   ;; install it separately via package-install
   ;; `M-x package-install [ret] company`
   (company-mode +1))

 ;; aligns annotation to the right hand side
 (setq company-tooltip-align-annotations t)

 ;; formats the buffer before saving


 (add-hook 'typescript-mode-hook #'setup-tide-mode)
 (require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.tsx\\'" . web-mode))
(add-hook 'web-mode-hook
         (lambda ()
           (when (and (buffer-file-name)
(string-equal "tsx" (file-name-extension buffer-file-name)))
             (setup-tide-mode))))
#+END_SRC

#+RESULTS:
| lambda | nil | (when (and (buffer-file-name) (string-equal tsx (file-name-extension buffer-file-name))) (setup-tide-mode))       |
| lambda | nil | (if (and (buffer-file-name) (string-equal tsx (file-name-extension buffer-file-name))) (progn (setup-tide-mode))) |

